src/test/resources/com/cardinity/model/payment_with_threeds2_data.json

{"amount":20.00,"currency":"EUR","description":"some description","settle":true,"country":"LT","order_id":"ord123456","payment_method":"card","payment_instrument":{"pan":"4111111111111111","exp_year":2021,"exp_month":1,"cvc":"123","holder":"John Doe"},"threeds2_data":{"notification_url":"http://notification.url","browser_info":{"accept_header":"text/html","browser_language":"en-US","screen_width":1920,"screen_height":1040,"challenge_window_size":"500x600","user_agent":"Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:21.0) Gecko/20100101 Firefox/21.0","color_depth":24,"time_zone":-60,"ip_address":"216.58.207.35","java_enabled":true,"javascript_enabled":false},"billing_address":{"address_line1":"8239 Louie Street","address_line2":"line2","address_line3":"line3","city":"Coltenburgh","country":"USA","postal_code":"84603","state":"DC"},"delivery_address":{"address_line1":"Schallerallee 33","city":"Ravensburg","country":"DEU","postal_code":"82940"},"cardholder_info":{"email_address":"card.holder@example.com","mobile_phone_number":"+353209120599","home_phone_number":"+353209174412","work_phone_number":"+353209134251"}}}